Config/DataProcessors/ОбменССистемойУчетаИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбменССистемойУчетаИмущества</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/СостояниеОбъектовУчетаРеестраИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеОбъектовУчетаРеестраИмущества</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКартРеестраИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУчетаИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаСистемыУчетаИмущества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СостояниеКартРеестраИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеКартРеестраИмущества</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКартРеестраИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ТипыФайловПередачиДляОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыФайловПередачиДляОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
					<Comment>текстовый формат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
					<Comment>формат XML</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РегистрацияСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияСведенийОбИмуществе</Name>
			<BasedOn>
				<xr:Item>Document.РегистрацияСведенийОбИмуществе</xr:Item>
				<xr:Item>Catalog.ОбъектыУчетаСистемыУчетаИмущества</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОбОбъектеИмущества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчетаИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаСистемыУчетаИмущества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитСведений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеквизитыСведенийОбИмуществе</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыРеквизитовСведенийОбИмуществе</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ЗаданиеНаЭкспортДанныхВБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаЭкспортДанныхВБанкиКС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Вид обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЕдиногоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект экспорта</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветWebСервиса</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроизвольныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ОбъектыУчетаСистемыУчетаИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыУчетаСистемыУчетаИмущества</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектУчетаИмущества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКартСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ОбменССистемойУчетаИмущества/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ВыполнитьОперацию(Операция, ПараметрыОбработки, АдресВХранилище = Неопределено) Экспорт
		
	Если Операция = "ОбменДанными" Тогда
		ОтправитьДанные(ПараметрыОбработки, АдресВХранилище);
	ИначеЕсли Операция = "ЗагрузитьДанные" Тогда
		ВыполнитьЗагрузкуСведений(ПараметрыОбработки, АдресВХранилище);
	ИначеЕсли Операция = "СоздатьКарты" Тогда
		СоздатьКарты(ПараметрыОбработки, АдресВХранилище);
	ИначеЕсли Операция = "ЗагрузитьСправочники" Тогда
		ЗагрузитьСправочники(ПараметрыОбработки);
	ИначеЕсли Операция = "ОбновитьСтатусыЗапросов" Тогда
		ОбновитьСтатусыЗапросов(ПараметрыОбработки);		
	ИначеЕсли Операция = "ОбновитьВсеСтатусы" Тогда
		ОбновитьВсеСтатусы(ПараметрыОбработки);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьПодключение(НастройкаОбмена) Экспорт
	
	Значение = Строка(Новый УникальныйИдентификатор);
	
	Параметры = Новый Структура("Value", Значение);
	
	ТекстЗапроса = СформироватьТекстЗапроса(НастройкаОбмена, "TestConnect", Параметры);
	Ответ = ПолучитьОтветПоЗапросу(ТекстЗапроса, НастройкаОбмена, Истина);

	Если Найти(Ответ, Значение) > 0 Тогда
		Результат = НСтр("ru = 'Соединение успешно установлено'");
	ИначеЕсли Найти(Ответ, "Unknown Username or Incorrect Password") > 0
				Или Найти(Ответ, "An error occurred when verifying security for the message") > 0 Тогда
		Результат = "Соединение установлено: неверно указан пользователь или пароль. Обмен невозможен";
	Иначе
		Результат = "Соединение не установлено";	
		Если Сред(Ответ, 1, 8) = "{Ошибка}" Тогда
			Результат = Результат + ":" + Символы.ПС + Сред(Ответ, 9);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОтправитьДанные(Настройки, АдресВХранилище)
	
	Если Настройки.ОбъектыУчетаИмущества.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		   
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегистрацияСведенийОбИмуществе.Ссылка,
	               |	РегистрацияСведенийОбИмуществе.Дата,
	               |	РегистрацияСведенийОбИмуществе.ОбъектУчетаИмущества
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	Документ.РегистрацияСведенийОбИмуществе КАК РегистрацияСведенийОбИмуществе
	               |ГДЕ
	               |	РегистрацияСведенийОбИмуществе.Организация = &Организация
	               |	И РегистрацияСведенийОбИмуществе.ОбъектУчетаИмущества В(&ОбъектыУчетаИмущества)
	               |	И НЕ РегистрацияСведенийОбИмуществе.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.Ссылка.Ссылка КАК Документ,
	               |	ВТ_Документы.ОбъектУчетаИмущества КАК ОбъектУчетаИмущества,
	               |	СостояниеОбъектовУчетаРеестраИмуществаСрезПоследних.Статус КАК Статус,
	               |	ФорматыОбменаБанкиКС.Ссылка КАК Формат
	               |ПОМЕСТИТЬ ОсновнаяТаблица
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОбъектовУчетаРеестраИмущества.СрезПоследних КАК СостояниеОбъектовУчетаРеестраИмуществаСрезПоследних
	               |		ПО ВТ_Документы.Ссылка.Организация = СостояниеОбъектовУчетаРеестраИмуществаСрезПоследних.Организация
	               |			И ВТ_Документы.Ссылка.ОбъектУчетаИмущества = СостояниеОбъектовУчетаРеестраИмуществаСрезПоследних.ОбъектУчетаИмущества,
	               |	Справочник.ФорматыОбменаБанкиКС КАК ФорматыОбменаБанкиКС
	               |ГДЕ
	               |	ФорматыОбменаБанкиКС.Владелец = &ТипОбмена
	               |	И ВТ_Документы.Ссылка В
	               |			(ВЫБРАТЬ ПЕРВЫЕ 1
	               |				ВТ.Ссылка
	               |			ИЗ
	               |				ВТ_Документы КАК ВТ
	               |			ГДЕ
	               |				ВТ.ОбъектУчетаИмущества = ВТ_Документы.ОбъектУчетаИмущества
	               |			УПОРЯДОЧИТЬ ПО
	               |				ВТ.Дата УБЫВ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновнаяТаблица.Документ КАК Объект,
	               |	ОсновнаяТаблица.Формат
	               |ИЗ
	               |	ОсновнаяТаблица КАК ОсновнаяТаблица";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	РеестрИмуществаСервер.СкопироватьОтборКомпоновкиДанныхВЗапрос(Запрос, Настройки.Отбор);
	
	Запрос.Текст = Запрос.Текст + "
	               |УПОРЯДОЧИТЬ ПО
	               |	ОсновнаяТаблица.Документ.Дата";
		
	Запрос.УстановитьПараметр("Организация"				, Настройки.Организация);
	Запрос.УстановитьПараметр("ТипОбмена"				, Настройки.ВидОбмена);
	Запрос.УстановитьПараметр("ОбъектыУчетаИмущества"	, Настройки.ОбъектыУчетаИмущества);	
	
	ОбъектыОбмена = Запрос.Выполнить().Выгрузить();
	
	Если ОбъектыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаданиеНаЭкспорт = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.СоздатьДокумент();
	
	ЗаданиеНаЭкспорт.Дата		= ТекущаяДатаСеанса();
	ЗаданиеНаЭкспорт.ДатаНач	= НачалоДня(ЗаданиеНаЭкспорт.Дата);
	ЗаданиеНаЭкспорт.ДатаКон	= КонецДня(ЗаданиеНаЭкспорт.Дата);
	
	ЗаполнитьЗначенияСвойств(ЗаданиеНаЭкспорт, Настройки, "Организация,ВидОбмена,НастройкаОбмена");

	ЗаданиеНаЭкспорт.ОбъектыОбмена.Загрузить(ОбъектыОбмена);
	
	Попытка
		ЗаданиеНаЭкспорт.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось создать документ ""Задание на экспорт данных"":'") = Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	Попытка
		Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.СформироватьФайлыЭкспорта(ЗаданиеНаЭкспорт);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось сформировать файлы:'") + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗаданиеНаЭкспорт.Ссылка);
		Возврат;
	КонецПопытки;	
	
	ТекстОшибки = "";	
	ЭкспортФайлов.ОтправитьФайлыПоHTTP(ЗаданиеНаЭкспорт.Ссылка,Неопределено,ТекстОшибки);
	
	Если ТекстОшибки <> "" Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;			
	
	ПоместитьВоВременноеХранилище(ЗаданиеНаЭкспорт.Ссылка, АдресВХранилище);
		
КонецПроцедуры

Процедура ВыполнитьЗагрузкуСведений(Настройки, АдресВХранилище)
	
	Настройки2 = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Настройки);
	Настройки2.Вставить("ИмяФорматаИмпорта", "DownloadCardResponse");
	Параметры = Новый Структура("RequestId", "");
	ДокументИмпорт = ПолучитьДокументИмпорта(Настройки2, "GetCardStates", Параметры);
	
	Если ДокументИмпорт = Неопределено Или ДокументИмпорт.ФайлыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АдресДанных = ПоместитьВоВременноеХранилище(Неопределено);	
		
	ДокументИмпортОбъект = ДокументИмпорт.ПолучитьОбъект();
	ДокументИмпортОбъект.ДополнительныеСвойства.Вставить("АдресДанных", АдресДанных);	
	Документы.ЗаданиеНаИмпортДанныхБанкиКС.ЗагрузитьОбъекты(ДокументИмпортОбъект);
	
	СостояниеКарт = ПолучитьИзВременногоХранилища(АдресДанных);
	Если СостояниеКарт = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагружаемыеКарты = ПолучитьКартыКЗагрузке(СостояниеКарт, Настройки);
	
	//ДокументыСведений = Новый Массив;
	
	ТекстЗапроса = СформироватьТекстЗапроса(Настройки.НастройкаОбмена, "GetCard");
	
	АдресДанных = ПоместитьВоВременноеХранилище(Настройки.ДанныеКарт);
	
	Для Каждого Строка Из ЗагружаемыеКарты Цикл
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("Карта",	Строка.ВидКарты.Раздел);
		ПараметрыЗапроса.Вставить("Id",		Строка.Идентификатор);
		
		//ДополнитьПараметрыЗапросаДатами(ПараметрыЗапроса);
		
		ТекстЗапросаКарты = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстЗапроса, ПараметрыЗапроса);
		
		Ответ = ПолучитьОтветПоЗапросу(ТекстЗапросаКарты, Настройки.НастройкаОбмена);
		Если Ответ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Документ = СформироватьДокументЭкспорта(Ответ, Настройки, ТекущаяДата(), "GetCard");
		
		// Читаем полученные данные
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.ДополнительныеСвойства.Вставить("АдресДанных", АдресДанных);
		
		Попытка
			Документы.ЗаданиеНаИмпортДанныхБанкиКС.ЗагрузитьОбъекты(ДокументОбъект);		
		Исключение
			// Не удалось сформировать сведения карты
			ТекстСообщения = Строка(Документ) + ":" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;				
		
	КонецЦикла;	
	
	// Дополним таблицу с данными сведений из запроса по статусам.
	
	ТаблицаДанныеКарт = ПолучитьИзВременногоХранилища(АдресДанных);
	
	Для Каждого Строка Из ТаблицаДанныеКарт Цикл
		
		Результат = СостояниеКарт.Найти(Строка.Идентификатор, "Идентификатор");
		Если Результат <> Неопределено Тогда
			//Строка.ВидКарты		= Результат.ВидКарты;
			Строка.Статус		= Результат.Статус;
			Строка.ДатаСтатуса	= Результат.Период;
		КонецЕсли;
		
	КонецЦикла;		
		
	ПоместитьВоВременноеХранилище(ТаблицаДанныеКарт, АдресВХранилище);
	
КонецПроцедуры

Процедура СоздатьКарты(Настройки, АдресВХранилище)
	
	Для Каждого Строка Из Настройки.ДанныеКарт Цикл  
		РеестрИмуществаСервер.СоздатьКарту(Настройки.Организация, Строка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьСправочники(Настройки)

	ДокументИмпорт = ПолучитьДокументИмпорта(Настройки, "GetAllDictionaries");
	
	Если ДокументИмпорт = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументИмпортОбъект = ДокументИмпорт.ПолучитьОбъект();
	Документы.ЗаданиеНаИмпортДанныхБанкиКС.ЗагрузитьОбъекты(ДокументИмпортОбъект);
		
КонецПроцедуры

Процедура ОбновитьСтатусыЗапросов(Настройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостояниеКартРеестраИмущества.Карта.ОбъектУчетаИмущества КАК ОбъектУчетаИмущества,
	               |	СостояниеКартРеестраИмущества.Идентификатор
	               |ИЗ
	               |	РегистрСведений.СостояниеКартРеестраИмущества КАК СостояниеКартРеестраИмущества
	               |ГДЕ
	               |	СостояниеКартРеестраИмущества.Карта В(&Документы)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СостояниеКартРеестраИмущества.Карта.Дата
	               |ИТОГИ ПО
	               |	СостояниеКартРеестраИмущества.Карта.ОбъектУчетаИмущества";
	
	Запрос.УстановитьПараметр("Документы", Настройки.Документы);
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	АдресДанных = ПоместитьВоВременноеХранилище(Неопределено);
	
	Для Каждого ОбъектУчетаИмущества Из Результат.Строки Цикл
		
		
		Для Каждого Документ Из ОбъектУчетаИмущества.Строки Цикл
			
			Если ЗначениеЗаполнено(Документ.Идентификатор) Тогда
				
				Параметры = Новый Структура("RequestId", "<requestId>" + Документ.Идентификатор + "</requestId>");
				ДокументИмпорт = ПолучитьДокументИмпорта(Настройки, "GetCardStates", Параметры);
				
				Если ДокументИмпорт = Неопределено Тогда
					ПоместитьВоВременноеХранилище(АдресДанных, Новый ТаблицаЗначений);
					Прервать;
				КонецЕсли;
				
				ДокументИмпортОбъект = ДокументИмпорт.ПолучитьОбъект();
				ДокументИмпортОбъект.ДополнительныеСвойства.Вставить("АдресДанных", АдресДанных);
				Документы.ЗаданиеНаИмпортДанныхБанкиКС.ЗагрузитьОбъекты(ДокументИмпортОбъект);
			КонецЕсли;
		КонецЦикла;
		
		СтатусыДокументов = ПолучитьИзВременногоХранилища(АдресДанных);
		
		Если СтатусыДокументов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗапроситьСтатусОбъекта = Ложь;
		
		Для Каждого СтатусДокумента Из СтатусыДокументов Цикл
			
			Запись = РегистрыСведений.СостояниеКартРеестраИмущества.СоздатьМенеджерЗаписи();
			Запись.Организация = Настройки.Организация;
			Запись.Карта = СтатусДокумента.Объект;
			Запись.Прочитать();
			
			Если Не Запись.Выбран() Или Запись.Статус <> СтатусДокумента.Статус Тогда
				//СтатусыДокументов.Добавить(Новый Структура("Документ,Статус", Документ.Ссылка, Статус));
				//Запись.Статус = Статус;
				ЗапроситьСтатусОбъекта = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЗапроситьСтатусОбъекта Тогда
			
			Параметры = Новый Структура("RequestId", "<requestId>" + ОбъектУчетаИмущества.ОбъектУчетаИмущества.Идентификатор + "</requestId>"); 
			ДокументИмпорт = ПолучитьДокументИмпорта(Настройки, "GetCardStates", Параметры);			
	
			ДокументИмпортОбъект = ДокументИмпорт.ПолучитьОбъект();
			ДокументИмпортОбъект.ДополнительныеСвойства.Вставить("АдресДанных", АдресДанных);
			Документы.ЗаданиеНаИмпортДанныхБанкиКС.ЗагрузитьОбъекты(ДокументИмпортОбъект);
			
			СтатусыДокументов = ПолучитьИзВременногоХранилища(АдресДанных);

		КонецЕсли;
		
		РеестрИмуществаСервер.ЗагрузитьСостояниеКарт(Настройки.Организация, СтатусыДокументов);
				
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбновитьВсеСтатусы(Настройки)
	
	ДокументИмпорт = ПолучитьДокументИмпорта(Настройки, "GetCardStatesAll");
	
	Если ДокументИмпорт = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументИмпортОбъект = ДокументИмпорт.ПолучитьОбъект();
	Документы.ЗаданиеНаИмпортДанныхБанкиКС.ЗагрузитьОбъекты(ДокументИмпортОбъект);
	
КонецПроцедуры

Функция ПолучитьДокументИмпорта(Настройки, ИмяМакета, Параметры = Неопределено)
	
	ТекстЗапроса = СформироватьТекстЗапроса(Настройки.НастройкаОбмена, ИмяМакета, Параметры);
	Ответ = ПолучитьОтветПоЗапросу(ТекстЗапроса, Настройки.НастройкаОбмена);
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Документ = СформироватьДокументЭкспорта(Ответ, Настройки, ТекущаяДата(), ИмяМакета);
	
	Возврат Документ;
	
КонецФункции

Функция СформироватьТекстЗапроса(НастройкаОбмена, ИмяМакета, ПараметрыЗапроса = Неопределено)
	
	Значения = ЭкспортФайлов.ПараметрыНастройкиОбменаБанкиКС(НастройкаОбмена);
	
	Хост			= Значения.Адрес;
	Пользователь	= Значения.Логин;	
	Пароль			= Значения.Пароль;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = Новый Структура;
	КонецЕсли;

	ПараметрыЗапроса.Вставить("Username",	Пользователь);
	ПараметрыЗапроса.Вставить("Password",	Пароль);
	ПараметрыЗапроса.Вставить("Host",		Хост);
		
	Если ИмяМакета = "GetCardStatesAll" Тогда
		ИмяМакета = "GetCardStates";
	КонецЕсли;
	
	ТекстЗапроса = Обработки.ОбменССистемойУчетаИмущества.ПолучитьМакет("ШаблонЗапроса_" + ИмяМакета).ПолучитьТекст(); 
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстЗапроса, ПараметрыЗапроса);
		
	Возврат ТекстЗапроса;	
	
КонецФункции

Функция ПолучитьОтветПоЗапросу(ТекстЗапроса, НастройкаОбмена, Тихо = Ложь)
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Connection", "Keep-Alive");
	ЗаголовокHTTP.Вставить("Content-Type", "application/soap+xml; charset=utf-8");	
	
	АдресРесурса = "";
	СоединениеHTTP = ЭкспортФайловКлиентСервер.ПолучитьСоединениеСИнтернет(НастройкаОбмена, АдресРесурса);
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса, ЗаголовокHTTP);
		
	ЗапросHTTP.УстановитьТелоИзСтроки(ТекстЗапроса);
	Попытка
		ОтветHTTP = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
	Исключение
		Если Тихо Тогда
			Возврат "{Ошибка}" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Иначе
			ТекстСообщения = "При выполнении обмена произошла ошибка:" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
			Возврат Неопределено;
		КонецЕсли;
	КонецПопытки;
	Ответ = ОтветHTTP.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	
	
	Возврат Ответ;
	
КонецФункции

Функция СформироватьДокументЭкспорта(ТекстОтвета, Настройки, ДатаДокумента, ИмяФорматаЭкспорта)
	
	Задание = Документы.ЗаданиеНаИмпортДанныхБанкиКС.СоздатьДокумент();
	Задание.Дата = ДатаДокумента;
	Задание.ДатаНач = НачалоДня(ДатаДокумента);
	Задание.ДатаКон = КонецДня(ДатаДокумента);
	
	ЗаполнитьЗначенияСвойств(Задание, Настройки);
	
	Задание.Записать(РежимЗаписиДокумента.Запись);
	
	Если Задание.ВидОбмена.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
		Расширение = "xml";
	Иначе
		Расширение = "txt";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		Попытка
			Кодировка = КодировкаТекста[Задание.ВидОбмена.КодировкаТекстаФайла];
		Исключение
			Кодировка = Задание.ВидОбмена.КодировкаТекстаФайла;
		КонецПопытки;
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла,Кодировка);
		ЗаписьТекста.Записать(ТекстОтвета);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ИмяВременногоФайла);
		ОбъектОбмена = Новый Структура;
		ОбъектОбмена.Вставить("Формат", Новый Структура("Наименование",ИмяФорматаЭкспорта));
		Если Настройки.Свойство("ИмяФорматаИмпорта") Тогда
			Задание.ДополнительныеСвойства.Вставить("ИмяФорматаИмпорта", Настройки.ИмяФорматаИмпорта);
		КонецЕсли;
		РеестрИмуществаСервер.СформироватьЗаданиеНаИмпорт(ОбъектОбмена, Задание, Файл);
	КонецЕсли;
		
	Задание.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Задание.Ссылка;
	
КонецФункции

Функция ПолучитьКартыКЗагрузке(Таблица, Настройки)
	
	КартыКЗагрузке = Новый ТаблицаЗначений;
	
	КартыКЗагрузке.Колонки.Добавить("Идентификатор",	Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36, ДопустимаяДлина.Фиксированная)));
	КартыКЗагрузке.Колонки.Добавить("ВидКарты",			Новый ОписаниеТипов("СправочникСсылка.ВидыКартСведенийОбИмуществе"));
	КартыКЗагрузке.Колонки.Добавить("Период",			Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	КартыКЗагрузке.Колонки.Добавить("Статус",			Новый ОписаниеТипов("СправочникСсылка.СтатусыКартРеестраИмущества"));

	//Если Таблица = Неопределено Тогда
	//	Возврат Новый ТаблицаЗначений;
	//КонецЕсли;
	
	Для Каждого Строка Из Таблица Цикл
		ЗаполнитьЗначенияСвойств(КартыКЗагрузке.Добавить(), Строка);
	КонецЦикла;
	
	Если ПустаяСтрока(Настройки.Отбор) И Настройки.Количество = 0 Тогда
		Возврат КартыКЗагрузке;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", КартыКЗагрузке);
	Запрос.УстановитьПараметр("Организация", Настройки.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Период,
	               |	Таблица.Идентификатор,
	               |	Таблица.ВидКарты,
	               |	Таблица.Статус
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОбъектыУчетаСистемыУчетаИмущества.Идентификатор
	               |ПОМЕСТИТЬ ВТ_Идентификаторы
	               |ИЗ
	               |	Справочник.ОбъектыУчетаСистемыУчетаИмущества КАК ОбъектыУчетаСистемыУчетаИмущества
	               |ГДЕ
	               |	ОбъектыУчетаСистемыУчетаИмущества.Организация = &Организация
	               |	И НЕ ОбъектыУчетаСистемыУчетаИмущества.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.Период,
	               |	Таблица.Идентификатор,
	               |	Таблица.ВидКарты,
	               |	Таблица.Статус,
	               |	ВЫБОР
	               |		КОГДА Таблица.Идентификатор В
	               |				(ВЫБРАТЬ
	               |					ВТ_Идентификаторы.Идентификатор
	               |				ИЗ
	               |					ВТ_Идентификаторы КАК ВТ_Идентификаторы)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Отсутствует
	               |ПОМЕСТИТЬ ОсновнаяТаблица
	               |ИЗ
	               |	Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ " + ?(Настройки.Количество = 0, "", "ПЕРВЫЕ " + Формат(Настройки.Количество, "ЧГ=")) + "
	               |	ОсновнаяТаблица.Период,
	               |	ОсновнаяТаблица.Идентификатор,
	               |	ОсновнаяТаблица.ВидКарты,
	               |	ОсновнаяТаблица.Статус
	               |ИЗ
	               |	ОсновнаяТаблица КАК ОсновнаяТаблица";
				   
	Если Не ПустаяСтрока(Настройки.Отбор) Тогда
		РеестрИмуществаСервер.СкопироватьОтборКомпоновкиДанныхВЗапрос(Запрос, Настройки.Отбор); 
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецЕсли
